In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Das','Zuker','Mohan','Newton'],
        'sales':[200,100,500,846,96,100]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    100
2    MSFT      Das    500
3    MSFT    Zuker    846
4      FB    Mohan     96
5      FB   Newton    100

In [5]:
bycomapany = df.groupby("Company")

In [6]:
bycomapany.mean()

         sales
Company
FB          98
GOOG       150
MSFT       673

In [9]:
bycomapany.sum().loc['FB']

sales    196
Name: FB, dtype: int64

In [10]:
bycomapany.sum()

         sales
Company
FB         196
GOOG       300
MSFT      1346

In [11]:
bycomapany.describe().transpose()

Company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean    98.000000  150.000000  673.000000
      std      2.828427   70.710678  244.658946
      min     96.000000  100.000000  500.000000
      25%     97.000000  125.000000  586.500000
      50%     98.000000  150.000000  673.000000
      75%     99.000000  175.000000  759.500000
      max    100.000000  200.000000  846.000000